stress-tests/Subscriptions-API/playground/get-subs.yaml
config:
  target: "https://dev-api-ops-subscriptions-thesis.leanderpeter.de"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up


scenarios:
  - name: "Get Subscriptions"
    flow:
      - get:
          url: "/subscriptions"
          headers:
            x-api-key: "{{ $processEnvironment.API_KEY }}"
            x-actor: "leander"